[
  {
    "id": 1,
    "title": "Add tags for solutions",
    "categoryId": 3,
    "upvotes": 112,
    "statusId": 1,
    "description": "Easier to search for solutions based on a specific stack.",
    "comments": [
      {
        "id": 1,
        "content": "Awesome idea! Trying to find framework-specific projects within the hubs can be tedious",
        "userId": 2
      },
      {
        "id": 2,
        "content": "Please use fun, color-coded labels to easily identify them at a glance",
        "userId": 3
      }
    ]
  },
  {
    "id": 2,
    "title": "Add a dark theme option",
    "categoryId": 5,
    "upvotes": 99,
    "statusId": 1,
    "description": "It would help people with light sensitivities and who prefer dark mode.",
    "comments": [
      {
        "id": 3,
        "content": "Also, please allow styles to be applied based on system preferences. I would love to be able to browse Frontend Mentor in the evening after my device’s dark mode turns on without the bright background it currently has.",
        "userId": 4
      },
      {
        "id": 4,
        "content": "Second this! I do a lot of late night coding and reading. Adding a dark theme can be great for preventing eye strain and the headaches that result. It’s also quite a trend with modern apps and  apparently saves battery life.",
        "userId": 5,
        "replies": [
          {
            "content": "While waiting for dark mode, there are browser extensions that will also do the job. Search for 'dark theme' followed by your browser. There might be a need to turn off the extension for sites with naturally black backgrounds though.",
            "replyingToId": 5,
            "userId": 6,
            "productRequestId": 2
          },
          {
            "content": "Good point! Using any kind of style extension is great and can be highly customizable, like the ability to change contrast and brightness. I'd prefer not to use one of such extensions, however, for security and privacy reasons.",
            "replyingToId": 6,
            "userId": 7,
            "productRequestId": 2
          }
        ]
      }
    ]
  }
]
